piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ make
gcc -Wall -std=c17 -g -c countdown.c -o countdown.o
gcc -Wall -std=c17 -g -o countdown countdown.o
piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ ./countdown
10
9
8
7
6
5
4
3
2
1
0
piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ gdb ./countdown
GNU gdb (Ubuntu 12.1-0ubuntu1~22.04) 12.1
Copyright (C) 2022 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./countdown...
(gdb) list
1       #include <stdio.h>
2
3       int main(int argc, char* args[])
4       {
5           for (int i = 10; i >= 0; i--) {
6               printf("%d\n", i);
7           }
8           return 0;
9       }
(gdb) run
Starting program: /home/piotr/dev/KaramonPiotr/cw01/countdown 
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/x86_64-linux-gnu/libthread_db.so.1".
10
9
8
7
6
5
4
3
2
1
0
[Inferior 1 (process 20244) exited normally]
(gdb) break 6
Breakpoint 1 at 0x555555555165: file countdown.c, line 6.
(gdb) run
Starting program: /home/piotr/dev/KaramonPiotr/cw01/countdown 
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/x86_64-linux-gnu/libthread_db.so.1".

Breakpoint 1, main (argc=1, args=0x7fffffffd878) at countdown.c:6
6               printf("%d\n", i);
(gdb) print i
$1 = 10
(gdb) continue
Continuing.
10

Breakpoint 1, main (argc=1, args=0x7fffffffd878) at countdown.c:6
6               printf("%d\n", i);
(gdb) print i
$2 = 9
(gdb) continue
Continuing.
9

Breakpoint 1, main (argc=1, args=0x7fffffffd878) at countdown.c:6
6               printf("%d\n", i);
(gdb) print i
$3 = 8
(gdb) info breakpoints 
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000555555555165 in main at countdown.c:6
        breakpoint already hit 3 times
(gdb) delete 1
(gdb) continue
Continuing.
8
7
6
5
4
3
2
1
0
[Inferior 1 (process 20414) exited normally]
(gdb) quit
piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ 

piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ make 
gcc -Wall -std=c17 -g -c countdown.c -o countdown.o
gcc -Wall -std=c17 -g -o countdown countdown.o
piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ ./countdown 
10
9
8
7
6
5
4
3
2
1
0
piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ ./countdown hello
arg: hello
10
9
8
7
6
5
4
3
2
1
0
piotr@DESKTOP-6A1J8DQ:~/dev/KaramonPiotr/cw01$ 